/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "Выбранный контент не мог быть воспроизведен.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Не удалось найти контент.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Не удалось воспроизвести текущую песню.";


/* kBRMediaNoContent*/
300 = "Контент не найден.";

/* kBRMediaNoPhotoContent */
301 = "В медиатеке iPhoto нет фотографий.";

/* kBRMediaNoPodcastContent */
302 = "В медиатеке iTunes нет подкастов.";

/* kBRMediaNotDRMAuthorized */
303 = "У Вас нет прав для воспроизведения этого контента.";

/* kBRMediaNoMovieFolderContent */
304 = "В папке «Фильмы» нет фильмов для воспроизведения.";

/* kBRMediaNoTVShowContent */
305 = "В медиатеке iTunes нет ТВ-шоу.";

/* kBRMediaNoMusicVideoContent */
306 = "В медиатеке iTunes нет видеоклипов.";

/* kBRMediaNoPlaylists */
307 = "В медиатеке iTunes нет плейлистов.";

/* kBRMediaNoSongContent */
308 = "В медиатеке iTunes нет песен.";

/* kBRMediaNoAudioBookContent */
309 = "В медиатеке iTunes нет аудиокниг.";

/* kBRMediaEmptyPlaylist */
310 = "В плейлисте нет песен.";

/* kBRMediaNoSuchPlaylist */
311 = "Не удалось найти выбранный плейлист.";

/* kBRMediaNoSuchSong */
312 = "Не удалось найти выбранную песню.";

/* kBRMediaNoMovies */
315 = "В папке «Фильмы» нет фильмов.";

/* kBRMediaNoSongForSlideshow */
316 = "Не удалось воспр. песню для этого слайд-шоу.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Не удалось воспр. песню для этого слайд-шоу.";

/* kBRVideoUnplayable */
318 = "Выбранное видео не удалось воспроизвести.";

/* kBRMediaRadioStreamUnplayable */
319 = "Выбранный Вами радиопоток не удалось воспроизвести.";

/* kBRRemoteMediaNoContent*/
350 = "Контент в этой медиатеке не найден.";

/* kBRRemoteMediaNoPhotoContent */
351 = "В этой медиатеке нет фотографий.";

/* kBRRemoteMediaNoPodcastContent */
352 = "В этой медиатеке нет подкастов.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "У Вас нет прав для воспроизведения этого контента.";

/* kBRRemoteMediaNoTVShowContent */
355 = "В этой медиатеке нет телешоу.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "В этой медиатеке нет видеоклипов.";

/* kBRRemoteMediaNoPlaylists */
357 = "В этой медиатеке нет плейлистов.";

/* kBRRemoteMediaNoSongContent */
358 = "В этой медиатеке нет песен.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "В этой медиатеке нет аудиокниг.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "В плейлисте нет песен.";

/* kBRRemoteMediaLoadingError */
361 = "При загрузке контента произошел сбой.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "Источник общего доступа к фотографиям недоступен.";

/* kBRDataSourceInitializationFailure*/
400 = "Контент не найден.";

/* kBRDataSourceURLResolutionFailure*/
410 = "Контент не найден.";

/* kBRDataSourceConnectionInProgressError */
420 = "Уже пытается подключиться к этому источнику.";


/* KBRSystemNetworkHostUnreachable */
501 = "Не удалось подключиться к этой медиатеке.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "Сейчас киноанонс воспроизвести нельзя.";

/* kBRSystemNotHDCPCompliant */
503 = "Для воспроизведения этого контента требуется поддержка HDCP.";

/* kBRSetupCantSetLanguage */
600 = "Не удалось изменить язык.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "Сейчас DVD невозможно воспроизвести.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "Данный DVD нельзя извлечь.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "Региональный код DVD не соответствует коду DVD-плеера.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "Данный DVD невозможно воспроизвести.";

/* kBRDVDErrorFatalDVDAlert */
754 = "Данный DVD невозможно воспроизвести.";

/* kBRCDErrorCantEjectCDAlert */
755 = "Данный CD нельзя извлечь.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "Защиту данного диска от копирования не удается подтвердить.";

/* kBRInternalResourceError */
900 = "Произошла ошибка.";

